Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_3.tmx
Source language: de
Languages: en

source: Elektrische Bandheizungsgeräte
en: Electric strip heating units

source: Elektrische Wassererwärmungsgeräte
en: Electric water heating apparatus

source: Elektrische Tauchsieder
en: Electric immersion heaters

source: Apparate zur Dehydrierung von Speiseabfällen
en: Apparatus for dehydrating food waste

source: Bewässerungsmaschinen für die Landwirtschaft
en: Watering machines for agricultural purposes

source: Wasserdruckminderer [Regelungszubehör]
en: Water pressure reducers [regulating accessories]

source: Temperatursensoren [Thermostatventile] für Zentralheizungskörper
en: Temperature sensors [thermostatic valves] for central heating radiators

source: Thermische Verbrennungsanlagen
en: Thermal incineration installations

source: Öfen für die Dekontamination von Metallen
en: Furnaces for decontaminating metals

source: Öfen zum Dekontaminieren von Altmetallen
en: Furnaces for decontaminating scrap metals

source: Hähne für sanitäre Anlagen
en: Taps for sanitary installations

source: Abscheider zum Entfernen von Kondenswasser durch Kühlung
en: Separators for removing condensation by refrigeration

source: Setzapparate für Wasser
en: Settler apparatus for water

source: Dekorative Gasbeleuchtungen
en: Decorative gas lighting sets

source: Dekorative Beleuchtungen
en: Decorative lighting sets

source: Gewerbliche Backöfen für Lebensmittel
en: Commercial ovens for baking food

source: Ventile [Wasserhähne] als Teile für sanitäre Anlagen
en: Valves [faucets] being parts for sanitary installations

source: Anzuchtkästen [elektrisch]
en: Propagators [electric]

source: Elektrische Beleuchtungsanlagen
en: Electrical lighting fixtures

source: Heizungsanlagen zur Verwendung mit gasförmigen Brennstoffen
en: Heating installations for use with gaseous fuels

source: Elektrisch beheizte Diffusionsöfen
en: Electrically heated diffusion furnaces

source: Elektrisch erhitzbare Kochtöpfe
en: Hot pots [electrically heated]

source: Heizkessel, ausgenommen Maschinenteile
en: Boilers, other than parts of machines

source: Kühlgefäße für Öfen
en: Coolers for furnaces

source: Luftbefeuchter für Zentralheizungskörper
en: Humidifiers for central heating radiators

source: Ansatzstücke für Gasbrenner
en: Brackets for gas burners

source: Solarien als Bräunungsgeräte, nicht für medizinische Zwecke
en: Solaria being suntanning apparatus, not for medical purposes

source: Heizgeräte für Gehwege
en: Pavement heating apparatus

source: Gasöfen
en: Gas ovens

source: Heißwassergeräte und Boiler
en: Water heaters and boilers

source: Elektroherde
en: Electric ranges

source: Kocher
en: Kilns

source: Heiz-Lüfter
en: Fan heaters

source: Ultraviolettlampen, nicht für medizinische Zwecke
en: Ultraviolet ray lamps, not for medical purposes

source: Brenner
en: Burners

source: Elektrische Toastöfen
en: Electric toaster ovens

source: Elektrische Röster
en: Electric roasters

source: Elektrische Radiatoren
en: Radiators, electric

source: Gasbetriebene Heizungsgeräte
en: Gas operated apparatus for heating

source: Anlagen zur Kühlung der Luft
en: Installations for the cooling of air

source: Lüftungsanlagen und -geräte [Klimatisierung]
en: Ventilation [air-conditioning] installations and apparatus

source: Spülvorrichtungen für Urinale
en: Flushing apparatus for urinals

source: Toiletten mit Spülkästen
en: Toilets incorporating cisterns

source: Abzüge und Installationen zum Ableiten von Abgasen
en: Flues and installations for conveying exhaust gases

source: Wasserreinigungs-, -entsalzungs- und –aufbereitungsanlagen
en: Water purification, desalination and conditioning installations

source: Kerntechnische Anlagen
en: Nuclear installations

source: Heizungs-, Ventilations-, Klima- und Luftreinigungsgeräte und -anlagen
en: Heating, ventilating, and air conditioning and purification equipment (ambient)

source: Kühl- und Gefrierausrüstung
en: Refrigerating and freezing equipment

source: Regelungs- und Sicherheitszubehör für Wasser- und Gasanlagen
en: Regulating and safety accessories for water and gas installations

source: Persönliche Heiz- und Trockengeräte
en: Personal heating and drying implements

source: Filter für Industrie und Haushalt
en: Filters for industrial and household use

source: Industrielle Aufbereitungsanlagen
en: Industrial treatment installations

source: Brenner, Boiler und Heizgeräte
en: Burners, boilers and heaters

source: Beleuchtung und Lichtreflektoren
en: Lighting and lighting reflectors

source: Sanitäre Installationen und Einrichtungen, Wasserversorgungsanlagen
en: Sanitary installations, water supply and sanitation equipment

source: Zierbrunnen, Beregnungs- und Bewässerungsanlagen
en: Decorative fountains, sprinkler and irrigation systems

source: Sanitär- und Badezimmerinstallationen sowie Sanitärarmaturen
en: Sanitary and bathroom installations and plumbing fixtures

source: Industrieöfen und Feuerungen [nicht für Nahrungsmittel und Getränke]
en: Industrial ovens and furnaces (not for food or beverages)

source: Beleuchtung und Lichtreflektoren für Fahrzeuge
en: Vehicle lighting and lighting reflectors

source: Heizungs-, Lüftungs- und Klimaanlagen für Fahrzeuge
en: Vehicle HVAC systems (heating, ventilation and air conditioning)

source: Maschinen zum Trocknen
en: Apparatus for drying

source: Elektrische Röster für gewerbliche Zwecke
en: Electric roasters for industrial purposes

source: Geräte zum Erhitzen von Nahrungsmitteln
en: Apparatus for heating foodstuffs

source: Tragbare Fußbäder
en: Portable foot baths

source: Elektrische Kaffeekessel
en: Electric coffee urns

source: Abwasseraufbereitungstanks für Haushaltszwecke
en: Waste water treatment tanks for household purposes

source: Brotbackmaschinen für gewerbliche Zwecke
en: Bread making machines for industrial purposes

source: Elektrische Schokoladenbrunnen
en: Chocolate fountains, electric

source: Desinfektionsapparate für medizinische Zwecke
en: Disinfectant apparatus for medical purposes

source: Elektrische Weinkeller
en: Wine cellars, electric

source: Elektrisch heizbare Socken
en: Socks, electrically heated

source: Kohleöfen [Raumheizgeräte für Haushaltszwecke]
en: Coal stoves [space heaters for household use]

source: Destillationsgeräte, nicht für wissenschaftliche Zwecke
en: Distillation apparatus not for scientific purposes

source: Trockengeräte für die chemische Verarbeitung
en: Drying apparatus for chemical processing

source: Elektrische Kochtöpfe für Haushaltszwecke
en: Electric cooking pots [for household purposes]

source: Elektrokochherde [für Haushaltszwecke]
en: Electric cooking stoves [for household purposes]

source: Elektrische Ventilatoren für Haushaltszwecke
en: Electric fans [for household purposes]

source: Elektrische Öfen für industrielle Zwecke
en: Electric furnaces [for industrial purposes]

source: Elektrische Panini-Toaster
en: Electric panini makers

source: Elektrische Heizstrahler für Haushaltszwecke
en: Electric radiant heaters [for household purposes]

source: Elektrische Radiatoren zum Heizen von Gebäuden
en: Electric radiators for heating buildings

source: Elektrische Raumkühlgeräte für Haushaltszwecke
en: Electric space cooling apparatus [for household purposes]

source: Elektrische Wasserreinigungsgeräte für Haushaltszwecke
en: Electric water purifiers for household purposes

source: Elektrische kabellose Kaffeekocher
en: Electric wireless coffeepots

source: Elektromagnetische Induktionskocher für Haushaltszwecke
en: Electromagnetic induction cookers [for household purposes]

source: Elektromagnetische Induktionskocher für gewerbliche Zwecke
en: Electromagnetic induction cookers for industrial purposes

source: Schläuche als Teile von Sanitärinstallationen für Waschbecken
en: Flexible pipes being parts of basin plumbing installations

source: Flexible Rohre als Bestandteile von Rohrleitungen für Badezimmer
en: Flexible pipes being parts of bath plumbing installations

source: Flexible Rohre als Bestandteile von Rohrleitungen für Duschen
en: Flexible pipes being parts of shower plumbing installations

source: Flexible Rohre als Bestandteile von Rohrleitungen für Spülbecken
en: Flexible pipes being parts of sink plumbing installations

source: Öfen für die chemische Industrie und Glasherstellungsindustrie
en: Furnaces for the chemical industry and glassmaking industry

source: Futontrockner für Haushaltszwecke
en: Futon driers [for household purposes]

source: Abfallverbrennungsöfen für Haushaltszwecke
en: Garbage incinerators for household purposes

source: Müllverbrennungsanlagen für gewerbliche Zwecke
en: Garbage incinerators for industrial purposes

source: Gaskochherde für Haushaltszwecke
en: Gas cooking ovens [for household purposes]

source: Gaserzeugungsöfen für Haushaltszwecke
en: Gas generating furnaces [for industrial purposes]

source: Gasöfen [Raumheizgeräte für Haushaltszwecke]
en: Gas stoves [space-heaters for household use]

source: Haartrockner für Haushaltszwecke
en: Hair dryers [for household purposes]

source: Haartrockengeräte für Schönheitssalons
en: Hair drying machines for beauty salon use

source: Haardämpfer für Schönheitssalons
en: Hair steamers for beauty salon use

source: Nicht elektrische Kochplatten für Haushaltszwecke
en: Non-electric cooking heaters for household purposes

source: Ölöfen [Raumheizgeräte für Haushaltszwecke]
en: Oil stoves [space heaters for household use]

source: Abzugshauben [Dunstabzugshauben für Haushaltszwecke]
en: Range hoods [extractor hoods, for household purposes]

source: Regelungszubehör für Gasrohre und -leitungen
en: Regulating accessories for gas pipes and lines

source: Grillspieße für Kochherde
en: Roasting spits for cooking ovens

source: Langsam brennende Heizöfen [Holzöfen für Haushaltszwecke]
en: Slow-burning stoves [wood stoves for household use]

source: Handtuchdampfgeräte für Frisierzwecke
en: Towel steamers [for hairdressing purposes]

source: Wasserreinigungsgeräte für Haushaltszwecke
en: Water purifiers for household purposes

source: Dochte für Ölöfen
en: Wicks for oil stoves

source: Wärmeplatten für Küchenschubladen
en: Warming drawers for kitchens

source: Rücklichter für Fahrzeuge
en: Taillights for vehicles

source: Sanitäre Apparate und Anlagen
en: Sanitary apparatus and installations

source: Badewannen
en: Bath tubs

source: Anlagen zum Kühlen
en: Cooling apparatus

source: Leuchten für Fahrzeuge
en: Lights for vehicles

source: Leuchten für Kraftfahrzeuge
en: Lights for automobiles

source: Beleuchtungsgeräte für Fahrzeuge
en: Lighting apparatus for vehicles

source: Tischlampen
en: Table lamps

source: Handtrockner für Waschräume
en: Hand drying apparatus for washrooms

source: Elektrische Handtrockner für Waschräume
en: Electric hand drying apparatus for washrooms

source: Lüftungsanlagen [Klimatisierung] für Fahrzeuge
en: Ventilation [air-conditioning] installations for vehicles

source: Klimaanlagen für Fahrzeuge
en: Air conditioners for vehicles

source: Luftreiniger
en: Air purifiers

source: Lampen für Fahrtrichtungsanzeiger von Fahrzeugen
en: Light bulbs for directional signals for vehicles

source: Lampen für Fahrtrichtungsanzeiger von Kraftfahrzeugen
en: Lamps for directional signals of automobiles

source: Elektrische Kaffeeperkolatoren
en: Coffee percolators, electric

source: Elektrische Kaffeemaschinen
en: Coffee machines, electric

source: Blendschutzvorrichtungen für Fahrzeuge [Lampenzubehör]
en: Anti-glare devices for vehicles [lamp fittings]

source: Blendschutzvorrichtungen für Kraftfahrzeuge [Lampenzubehör]
en: Anti-dazzle devices for automobiles [lamp fittings]

source: Strahler
en: Spotlights

source: Scheinwerfer für Kraftfahrzeuge
en: Headlights for automobiles

source: Elektrische Schnellkochtöpfe
en: Pressure cooking saucepans, electric

source: Abzugshauben für Küchen
en: Extractor hoods for kitchens

source: Wasserenthärtungsapparate und -anlagen
en: Water softening apparatus and installations

source: Eismaschinen
en: Ice machines

source: Eismaschinen und -apparate
en: Ice machines and apparatus

source: Elektrische Dampfgarer
en: Food steamers, electric

source: Sterilisatoren für Telefonhörer
en: Sterilizers for telephone receivers

source: Turbinenventilatoren [Lüftungsapparate]
en: Turbine ventilators [ventilation apparatus]

source: Magnetfilter zur Verwendung in Zentralheizungssystemen
en: Magnetic filters being for use in central heating systems

source: Magnetfilter als Teile von Zentralheizungsgeräten
en: Magnetic filters being parts of central heating apparatus

source: Elektrische Schuhtrockner
en: Electric shoe dryers

source: Luftschleieranlagen zur Belüftung
en: Air curtains for ventilation

source: Ionisierungsapparate für die Wasseraufbereitung
en: Ionization apparatus for the treatment of water

source: Sterilisatoren für Haushaltszwecke
en: Sterilizers for household use

source: Dampfsterilisatoren für industrielle Zwecke
en: Steam sterilizers for industrial use

source: Dampfsterilisatoren für Haushaltszwecke
en: Steam sterilizers for household use

source: Destillationskolonnen für industrielle Zwecke
en: Vacuum distillation columns for industrial use

source: Vakuumdestillationsapparate für industrielle Zwecke
en: Vacuum distillation apparatus for industrial use

source: Sprinklersysteme für die Rasenbewässerung
en: Sprinkler systems for lawn irrigation

source: Sprinklersysteme für die Bewässerung
en: Sprinkler systems for irrigation

source: Elektrische Raumheizkörper für Haushaltszwecke
en: Electric space heating apparatus for household use

source: Chemisch aktivierte Heizkissen, nicht für medizinische Zwecke
en: Chemically activated heating pads, not for medical purposes

source: Abflussrohre für sanitäre Anlagen
en: Waste pipes for sanitary installations

source: Spezialtoiletten für medizinische Patienten
en: Toilets adapted for medical patients

source: Freistehende Papierlaternen
en: Freestanding paper lanterns

source: Wandmontierte Einläufe für Bidets
en: Wall-mounted spouts for bidets

source: Wandmontierte Einläufe für Handwaschbecken
en: Wall-mounted spouts for wash-hand basins

source: Einhebelmischer für Spülsteine
en: Single-lever faucets for sinks

source: Japanische Papierlaternen
en: Japanese paper lanterns

source: Tragbare Papierlaternen
en: Portable paper lanterns

source: Im Fenster montierte Klimageräte
en: Window-mounted air conditioning units

source: Kühlsysteme für Eisbahnen
en: Ice rink chiller systems

source: Keimtötende Lampen
en: Germicidal lamps

source: Spülhebel für Toiletten
en: Flush levers for toilets

source: Filter für Bühnenbeleuchtungen
en: Filters for stage lighting

source: Fußwärmer, nicht elektrisch
en: Non-electric footwarmers

source: Beleuchtungsgeräte mit optischen Fasern
en: Lighting apparatus incorporating optical fibers

source: Elektrische Abgabegeräte für Raumerfrischer
en: Electric dispensers for room deodorants

source: Elektrische Abgabegeräte für Lufterfrischer
en: Electric dispensers for air fresheners

source: Abgabesysteme für Raumerfrischer
en: Room deodorant dispensing systems

source: Abgabesysteme für Lufterfrischer
en: Air freshener dispensing systems

source: Ventilatoren für Haushaltszwecke
en: Ventilating fans for household use

source: Sterilisatoren für Laborzwecke
en: Sterilizers for laboratory use

source: Diffusionsöfen für industrielle Zwecke
en: Diffusion furnaces for industrial use

source: Destillierapparate für industrielle Zwecke
en: Distillation apparatus for industrial use

source: Farbfilter für Beleuchtungsapparate
en: Color filters for lighting apparatus

source: Luftfilter für industrielle Zwecke
en: Air filters for industrial use

source: Bewässerungsgeräte für den Gartenbau
en: Irrigation apparatus for horticultural use

source: Chromatographiesäulen für industrielle Zwecke
en: Chromatography columns for industrial use

source: Automatische Ionenaustausch-Chromatografiegeräte für industrielle Zwecke
en: Automatic ion exchange chromatography apparatus for industrial use

source: Automatische Chromatografiegeräte für industrielle Zwecke
en: Automatic chromatography apparatus for industrial use

source: Gaschromatographieapparate für industrielle Zwecke
en: Gas chromatography apparatus for industrial use

source: Flammenlose Leuchtdioden [LED]-Kerzen
en: Flameless light-emitting diode candles

source: Tragbare Gasbrenner
en: Portable gas burners

source: Infrarotlampen nicht fÃ¼r medizinische Zwecke
en: Infrared lamps, not for medical purposes

source: Klärtanks für Haushaltszwecke
en: Septic tanks for household purposes

source: Klärtanks für industrielle Zwecke
en: Septic tanks for industrial purposes

source: Abwasseraufbereitungstanks für industrielle Zwecke
en: Wastewater treatment tanks for industrial purposes

source: Ventilatoren für industrielle Zwecke
en: Ventilating fans for industrial use

source: Ventilatoren für gewerbliche Zwecke
en: Ventilating fans for commercial use

source: Wassererhitzer für industrielle Zwecke
en: Water heaters for industrial use

source: Elektrische Raumkühlgeräte
en: Electric space cooling apparatus

source: Luftreinigungsgeräte für Haushaltszwecke
en: Air purifying units for household use

source: Luftreinigungsgeräte für gewerbliche Zwecke
en: Air purifying units for commercial use

source: Dampfsterilisatoren für Laborzwecke
en: Steam sterilizers for laboratory use

source: Wasserstrahldüsen für Whirlpools
en: Water jets for use in hot tubs

source: Ionisierungsapparate für die Luftaufbereitung
en: Ionization apparatus for the treatment of air

source: Bioreaktoren für die Abfallaufbereitung
en: Bioreactors for use in the treatment of waste

source: Bioreaktoren für die Abwasseraufbereitung
en: Bioreactors for use in the treatment of wastewater

source: Beheizte Polymerisationsgeräte für Dentalsanierungsmassen
en: Heated polymerisation units for dental restoration compounds

source: Wasserreinigungsgeräte für die Zubereitung von Trinkwasser
en: Water purifying units for producing potable water

source: Transportable Urinale für Veranstaltungen im Freien [sanitäre Anlagen]
en: Portable urinals for outdoor activities [sanitary installations]

source: Mobile Lichtmasten
en: Mobile light towers

source: Luftbefeuchter für Musikinstrumente
en: Humidifiers for musical instruments

source: Gasbrenner für industrielle Zwecke
en: Gas burners for industrial purposes

source: Kamineinsatze in Form von festen Brennstoffbrennern
en: Fireplace inserts in the nature of solid fuel burners

source: Elektrische Raumdesodorisierungsgeräte
en: Electric room deodorizing units

source: Elektrische Festbeleuchtung
en: Electric holiday lights

source: Chemilumineszierende Lichtstäbe
en: Chemiluminescent light sticks

source: Brotbackautomaten für Haushaltszwecke
en: Automatic bread-making machines for domestic use

source: Luftfilter für industrielle Anlagen
en: Air filters for industrial installations

source: Luftfilter für Haushaltszwecke
en: Air filters for household use

source: WC-Schüsseln mit eingebautem Wasserstrahl
en: Toilet bowls with integrated bidet water jets

source: Gasbacköfen für Haushaltszwecke
en: Gas cooking ovens for household use

source: Elektrische Kochherde für Haushaltszwecke
en: Electric cooking stoves for household use

source: Elektrische Backöfen für Haushaltszwecke
en: Electric cooking ovens for household use

source: Elektrische Kaffeemaschinen für Haushaltszwecke
en: Electric coffee makers for household use

source: Elektrische Wäschetrockengeräte für Haushaltszwecke
en: Electric clothes drying machines for household use

source: Bewegungsempfindliche Sicherheitslichter
en: Motion sensitive security lights

source: Elektrische Tortillapressen
en: Tortilla presses, electric

source: Holzkohlegrills für Haushaltszwecke
en: Charcoal roasters for household purposes

source: Elektrische Getränkewärmer
en: Electric beverage warmers

source: LED-Taschenlampen
en: LED flashlights

source: Beleuchtungsgeräte mit organischen Leuchtdioden [OLED]
en: Organic light emitting diodes (OLED) lighting devices

source: Kühlschränke für Kosmetik
en: Cosmetic refrigerators

source: Transportable Kühlschränke
en: Portable refrigerators

source: Tragbare Verdampfungskühlgeräte
en: Portable evaporative air coolers

source: Elektrische Ventilatoren mit Verdampfungskühlgeräten
en: Electric fans with evaporative cooling devices

source: Elektrische Eierdampfkocher für Haushaltszwecke
en: Electric egg steamers for household purposes

source: Desinfektionsapparate für Banknoten
en: Disinfectant apparatus for banknotes

source: Klimaanlagen für Kraftfahrzeuge
en: Air conditioning installations for cars

source: Dampfsterilisatoren für Fußböden
en: Steam sterilizers for floors

source: Sterilisiergeräte für Zahnbürsten
en: Sterilizers for toothbrushes

source: Ölfreie elektrische Fritteusen
en: Oil-free electric fryers

source: Haartrockner für Schönheitssalons
en: Hair driers for use in beauty salons

source: Gefriertruhen
en: Chest freezers

source: Kamineinsätze in Form von Heizöfen
en: Fireplace inserts in the nature of stoves

source: Fiberoptische Beleuchtungsanlagen
en: Fiber optic lighting installations

source: Abflussrohre für Badewannen
en: Waste pipes for bathtubs

source: Raumheizapparate für industrielle Zwecke
en: Space heating apparatus for industrial use

source: Geräte zur Chlorung für die Wasseraufbereitung
en: Chlorinating units for water treatment

source: Apparate für Dampferzeugungsanlagen
en: Apparatus for vapour producing installations

source: Industrielle Trocknungsanlagen
en: Industrial drying installations

source: Industrielle Kühlanlagen
en: Industrial cooling installations

source: Wasserreinigungsapparate für Meerwasseraquarien
en: Aquarium sea water purifying apparatus

source: Axialventilatoren für Klimaanlagen
en: Axial fans for air-conditioning

source: Butangasbrenner für die Küche
en: Butane torches for kitchen use

source: Ethanol-Feuerstellen
en: Ethanol fireplaces

source: Japanische Brennstoff-Taschenwärmer
en: Japanese pocket warmers filled with fuel

source: Kühlgeräte für Kimchi
en: Kimchi refrigerators

source: LED-Beleuchtungssätze für Leuchtschilder
en: LED lighting assemblies for illuminated signs

source: Flüssigchromatografiegeräte für industrielle Zwecke
en: Liquid chromatography apparatus for industrial use

source: Toilettenschüsseln und -sitze im Set
en: Toilet bowls and seats sold as a unit

source: Leere Wasserfilter-Flaschen
en: Water filtration bottles sold empty

source: Wasserbehandlungsanlagen für die Belüftung und Zirkulierung von Wasser
en: Water treatment units for aerating and circulating water

source: Kühlapparate und -maschinen
en: Refrigerating apparatus and machines

source: Kühlanlagen und -maschinen
en: Cooling installations and machines

source: Gasbetriebene Geräte zum Kühlen
en: Gas operated devices used in cooling

source: Gasbetriebene Geräte zum Trocknen
en: Gas operated devices used in drying

source: Gasbetriebene Geräte zum Sieden
en: Gas operated devices used in boiling

source: Filter-/Motorkombinationen für Aquarien
en: Filter-motor combinations for aquariums

source: Industrielle Kochanlagen
en: Industrial cooking installations

source: Filter für Luftreiniger
en: Filters for air purifiers

source: Elektrische Wasserreinigungsfilter für Haushaltszwecke
en: Electric water purification filters for household purposes

source: Heizanlagen für Kraftfahrzeuge
en: Heating systems for motor cars

source: Kühlanlagen für Kraftfahrzeuge
en: Cooling systems for motor cars

source: Luftreiniger für Kraftfahrzeuge
en: Air purifiers for automobiles

source: LED-Beleuchtungen für Kraftfahrzeuge
en: Light emitting diode lights for automobiles

source: Elektrische Trockengeräte für Haushaltszwecke
en: Electric drying apparatus for household purposes
